class DataQA {
  var questions = [
    [
      "من المستهدف بهذه المؤشرات؟",
      "كل  من له صلة مباشرة بالأطفال (الأب - الأم - المعلم - المرشد الطلابي - رائد النشاط...) ولمزيد من الدقة  ‏يمكن أن يكرر تنفيذ المقياس من عدة أشخاص لصيقين به كالأب والام كل لوحده، ولن يعطي اي نتيجة منطقية في حال تقييم الطفل لنفسه"
    ],
    [
      "من وضع نظرية الذكاءات المتعددة ومتى؟",
      "نظرية الذكاءات المتعددة (بالإنجليزية: Multiple Intelligence) هي نظرية وضعها عالم النفس هاورد غاردنر عام 1983"
    ],
    [
      "ما مفهوم الذكاء  لدى هاورد غاردنر ؟",
      "المفهوم التقليدي للذكاء كان يدور في فلك التكيف وسرعة البديهة والفطنة وحسن التصرف .أما مفهوم الذكاء لدى هاورد غاردنر، والتي حملها كتابه ( أشكال العقل البشرى )و(أطر العقل) ترفض فكرة أن الإنسان يمتلك ذكاء واحداً، بل ذكاءات مستقلة، يشغل كل منها حيزاً معيناً في دماغه، ولذلك جاء تعريفه للذكاء إجرائيا القدرة  على حل المشكلات في شيء ما وابتكار نتائج ذات قيمة فيه"
    ],
    [
      "ما أهم المرتكزات نظرية الذكاءات المتعددة؟",
      "١- تنطلق نظرية الذكاءات المتعددة من مسلمة مفادها أن  كل الأطفال يولدون ولديهم كفاءات ذهنية متعددة منها ما هو ضعيف ومنها ما هو قوي . ومن شأن التربية الفعالة أن تمتن ما لدى المتعلم من كفاءات ضعيفة وتعمل في الوقت نفسه على زيادة تنمية ما هو قوي لديه\n\n٢- تؤكد النظرية أنه من المهم تعزيز نقاط القوة لدى الفرد وعدم إهمال النقاط الأخرى الأقل بدلا من الإصرار على حصر الطفل في نقاط الضعف ."
    ],
    [
      "هل لدينا فرد ذكي أو أقل ذكاءا؟",
      "نظرية الذكاءات المتعددة ليست نظرية لتحديد إذا ما كان الفرد ذكيا أم لاجاءت لتطرح مفهوم تعدد الذكاءات واختلاف طبيعتها من فرد لآخر."
    ],
    [
      "ما طبيعية الذكاءات المتعددة ؟",
      "توضح النظرية أن الذكاءات الثمانية تتكامل وتعمل معا بطرق معقدة وليس هناك نوع من الذكاءات يوجد منفردا فنحن نمتلك كل الذكاءات بنسب متفاوتة ."
    ],
    [
      "ماهي الذكاءات الذكاءات الثمانية التي يتفاوت الأفراد فيها.",
      "1- الذكاء اللغوي / اللفظي\n2- الذكاء البصري / الفراغي\n3- الذكاء المنطقي / الرياضي\n4- الذكاء الجسدي / الحركي\n5- الذكاء الطبيعي / البيئي\n6- الذكاء الاجتماعي مع الأخرين\n7- الذكاء الذاتي مع نفسه\n8- الذكاء الصوتي / الايقاعي"
    ],
    [
      "ماذا سأستفيد من هذا المقياس",
      "معرفة الذكاءات وسيلة وليست هدفا في حد ذاته فلا قيمة لتسمية الأفراد أو منحهم درجة ما تعبر عن ذكائهم؛ وإنما القيمة الأهم هي القرارات التي تبنى على هذه التسمية، بالعمل على تنمية  قدراته العليا أو اتخاذ القرارات الهامة في حياته بناء على معرفته بنقاط قوته وضعفه، ومن أهم الفوائد\n ١-تتعرف على أعلى القدرات الفطرية لدى طفلك.\n ٢- استهداف الذكاءات العليا  يضمن بحول الله أعلى كفاءة وفاعلية في تعلمه وممارسة أنشطته\n ٣- معرفة ترتيب الذكاءات المتعددة يساعد على معرفة ميول الطفل واهتماماته والذي يسهل اكتشاف موهبته واستثمارها وتنميتها\n ٤-باستهداف الذكاءات العليا تحسّن صورة الطفل الذهنية عن نفسه وقدراته وتعزز تفرده\n ٥-بمعرفة ترتيب الذكاءات نقلل الهدر في شراء هدايا أو ألعاب لا تتوافق مع ميوله ولا طبيعته ونختصر الوقت والجهد في استخدام الأساليب التي تضمن تفاعله."
    ],
    [
      "ما العمر الذي يتناسب معه تنفيذ هذا المقياس ؟",
      "مقياس الذكاءات المتعددة يتناسب مع الكبار والصغار ولكن مؤشرات هذا التطبيق صيغت بأسلوب يتوافق مع سلوك الأطفال من عمر ٤ - ١٢"
    ],
    [
      "هل يعتبر هذا المقياس كافيا لاستكشاف ذكاءات ابني؟",
      "نتيجة هذا المقياس تعتبر مؤشرا قويا اذا ما تم تنفيذه بدقة ولا يعتبر كاف بل يحتاج لدعمه بالملاحظة المقصودة في\n ١-طريقة تعامله مع المعرفة\n ٢-المواد الدراسية المحببة له\n ٣-ميله لألعاب وأنشطة محددة\n ٤-طريقته في التعامل مع المثيرات المختلفة\n ٥-مجالات تميزه واهتمامه\n ٦-طريقته في حل المشكلات وابداع منتجات"
    ],
    [
      "هل ترتيب ذكاءات ابني ثابتة تم متغيرة؟",
      "الذكاءات تتبدل مع السنوات وهو أمر طبيعي جدًا ؛ حيث يعتمد نمو الذكاءات على البيئة و التعلم والثقافة التي يعيش فيها الفرد."
    ]
  ];
}
