import 'package:child_iq/data/theme.dart';
import 'package:flutter/material.dart';

class Suggest {
  ffuunn() {
    var x = [zero, one, two, three, four, five, six, seven];
    return x;
  }

  static Color coloor = StyleCustom().blue;
  var zero = Column(
    mainAxisAlignment: MainAxisAlignment.center,
    crossAxisAlignment: CrossAxisAlignment.center,
    children: <Widget>[
      Text("أنشطة لدعم الذكاء اللفظي",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "يعد الذكاء اللفظي/ اللغوي هو القدرة على استخدام اللغة للتعبير، والتواصل، الإقناع، التحفيز، طرح معلومات وأفكار... ويتضمن الذكاء اللغوي ليس فقط إنتاج اللغة، ولكن حساسية عالية للفروق الطفيفة بينالكلمات، وترتيب وسجع الكلمات.",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text(
          "1-القاموس الشخصي للطفل\nجمع الكلمات الجديدة التي يتعلمها يوميا من المجلات او أسماء المحلات وغيرها\n2-كتابة مذكرات\nقدم له مذكرة جميلة واطلب منه ان يكتب بها افكاره وملاحظاته يوميا\n3-صندوق البريد الأسري\nيسعد الاطفال عندما تعلمه كيف يحول فكرة الى كلمات \n4-بناء القصة\nساعد طفلك على تمييز أجزاء القصة ليكون اكثر وعيا بما يقرأ الشخصيات - الزمان والمكان - المشكلة - الحل\n5-معان مختلفة\nاجعل الطفل يبحث عن كلمة يعرف معناها جيدا مثلا سفينة واعرضها عليه في سياق مختلف مثلا كلنا في سفينة واحدة\n6-شبكة الكلمات\nاختر كلمة مثلا وسيلة المواصلات واكتبها في منتصف الصفحة واطلب منها ان يفكر في اشياء اخرى متعلقة بها  مثلا استخدامات - وصفها",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start)
    ],
  );
  var one = Column(
    mainAxisAlignment: MainAxisAlignment.center,
    crossAxisAlignment: CrossAxisAlignment.center,
    children: <Widget>[
      Text("الذكاء المنطقي",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "يعكس الذكاء المنطقي قدرة الشخص على فهم واستخدام الأرقام بفاعلية، إضافة لقوة الاستنتاجوالتصنيف لديه، وتعامله البارع مع الرموز المجردة. ويميل هذا الشخص للدقة والنظام والمنهجية. ويتمتع به كل من: مبرمجي الكمبيوتر، المحاسبين، الفلاسفة، والعلماء: الرياضيين الطبيعيين، الاجتماعيين،النفسيين... فمثلا يعتبر كل من بيل جيتس وألبرت أينشتاين مثالا قويا لهذا النوع من الذكاء.",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("ويتميز صاحب الذكاء بالقدرات التالية",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "-يمكنه إجراء العمليات الحسابية في عقله بسهولة يحب إجراء التجارب في المدرسة والبيت.\n-يحب إجراء التجارب في المدرسة والبيت يعتبر الحساب والعلوم من أفضل المواد بالنسبة له.\n-يجري العديد من التجارب ليتبين عن طريقها كيف تعمل الأشياء، وليختبر الاحتمالات الممكنة و دائم التفكير والسؤال: ماذا لو؟.\n-يبدي فضولا وحب استطلاع عن كيف تعمل الأشياء يحب الأنشطة التي تعتمد على قواعد و يستمتع بالألعاب التي تتطلب تفكيرا منطقيا يحب ألعاب الكمبيوتر.\n-يحب القراءات العلمية، ويتابع التطورات العلمية ولديه قدرة جيدة في الأنشطة العلمية والحسابية والمنطقية ويحب لعب الألعاب التي تحتاج لتفكير واستراتيجيات كالشطرنج، الألغاز المنطقية، القصص الحسابية الكلامية",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text(
          "-يحب متابعة ومعرفة المنطق فيما يفعله أو يقوله الناس يعتقد أن كل شيء له تفسير منطقي يشعر بالحاجة لقياس الأشياء، تصنيفها، وزنها، تحليلها\n- يمكنه التفكير في المفاهيم المجردة، بلا كلمات، أو صور ويستمتع بالأرقام، الأشكال، النماذج، العلاقات. ويسهل عليه وضع الأشياء في تصنيف محدد\n- يحب زيارة المتاحف، ومعارض الاكتشافات والمخترعات الحديثة ويميز ويلتقط الأنماط (التكرار) والعلاقات في البيئة، مثال: ترتيب الألوان بطريقة تكرارية معينة، ترتيب المنتجات في المتجر بطريقة تكرارية معينة...، أنماط الهجاء مثل (سوسو، كوكو، مرمر...)، وينتبه لهذه الأنماط التكرارية بسهولة.",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text(
          "- يمكنه شرح الكيفية التي يعمل بها، أو يحل بها المشكلة.\n- يمكنه أن يبرهن على صحة رأيه، أو صحة ما لديه من معرفة .\n- يمكنه استخدام ما لديه من معلومات لحل مشكلة تواجهه ونقد الأحداث أو المعلومات تبعا لما لديه من أسباب ومبررات معروفة، أي وفق قاعدة معينة للحكم\n- يتبين ويتعلم المفاهيم الرياضية: القسمة، الضرب، الجمع، الطرح ييميل للتحليلات والإحصاءات\n- لا يمكنه ابتكار أفكار جديدة لحل المشكلات التي تواجهه يميل للطريقة التحليلية لحل المشكلات.",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("مقترحات للتنمية",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "- امنح طفلك فرصا للبحث وحل المشكلات - علم طفلك مهارة طرح الأسئلة - امنح الطفل فرصا للاستكشاف - ساعد طفلك على الوصول لإجابات لأسئلته - دنم لدى طفلك مهارات التفكير المختلفة وخاصة النقدي (الملاحظة، التصنيف، الاستنتاب السد والنتيجة التمييز بين الحقائق والرأي الشخصي، حل المشكلات، اتخاذ القرار، المقارنة - امنحه أدوات للقياس والملاحظة، والتصنيف - اعمل على تنمية المفاهيم والعلاقات المجردة لديه - اشترك معه في حل الألغاز والألعاب الحسابية - أشرك طفلك في الأنشطة الحسابية اليومية -  امنحه فرصة التصرف في ماله الخاص - أشركه في إدارة ميزانية الأسرة. ",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("أنشطة.. منطقية\n أولاً الفوازير:المنطقية والرياضية",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text("ستجد بعضا منها في الموقع التالي",
          style: TextStyle(fontSize: 14), textAlign: TextAlign.start),
      Text("Www.johnpratt.com\nثانيا: الألعاب",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "ستجد في هذا الموقع مجموعة من الألعاب التي تعمل على تنمية الذكاء المنطقي الرياضي",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("Woodlands-kent.junior",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text("ثالثا: الأنشطة التي تتطلب إستراتيجية ومنطقا",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text("يمكن أن تجد هذه الأنشطة في الموقع التالي",
          style: TextStyle(fontSize: 14), textAlign: TextAlign.start),
      Text("mikids.com",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text("رابعا: ويمكن تنمية الذكاء المنطقي الرياضي من خلال",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "1- التصنيف: علامة مميزة... أو أي محدد تختاره سلفا مع الطفل امارس مع طفلك تصنيف الأشياء الموجودة مثلا بالمنزل يوميا: تبعا للون، الحجم، الطول، ... أي صفةومن أمثلة عملية التصنيف:\nتصنيف الملابس التي تحتاج إلى تنظيف حسب ألوانها أو درجة الحرارة التي تحتاجها للغسيل، اللعب، حسب القاري من الأسرة...). العرائس، المكعبات، الأكواب، الكتب (كتب أدبية، علمية،.. حسب اسم الكاتب، حسب الحرف الأبجدي الأول،\n2- التشابه والمختلفة: اسأل طفلك ما المتشابه والمختلف في الأشياء، الأماكن، الأشخاص... إلخ، مثلا: اما التشابه بين عين الطائر ( ) وبين عين الطائر ()؟ ما التشابه بين عمر ومنة من حيث الصفات، الطول، الوزن، اللون، الأكلات المحببة، الكتب المحببة.. إلخ، وذلك من حيث رد الفعل إذا حدث... (اقترح مواقف). اما التشابه في المشاعر بين بطل قصة اليوم وأمس؟\nومن أنشطة التشابه: أحضر مجلات، جرائد، شريطا لاصقا، مقصات، خطين، كلا منهما 36 بوصة. ارسم دوائر كبيرة متقاطعة",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
    ],
  );
  var two = Column(
    mainAxisAlignment: MainAxisAlignment.center,
    crossAxisAlignment: CrossAxisAlignment.center,
    children: <Widget>[
      Text("الذكاء المكاني- البصري",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "وهو ما يعرف بـ ذكاء الصورة ويعني القدرة على التخيل بدقة، والتفكير في الأشياء بصريا عن طريق التصور، مع امتلاك القدرة على تعديل هذا التصور المرئي في الذهن قبل أن يترجمه الشخص إلى واقع كما يعرف أيضا بـالذكاء الفضائي او الفراغي ، وهو التميز في القدرة على استعمال الفضاء أو الفراغ بشتى أشكاله -أو ما يعرف بما في ذلك قراءة الخرائط والجداول والمخططات وتخيل الأشياء وتصور المساحات... إلخ",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("تمييز أصحاب الذكاء البصري",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "يستمتع بالأنشطة الفنية كالرسم، التلوين، النحت، التشكيل. يرسم أشكالا متطورة عن مرحلته العمرية. يحب الفك والتركيب، والبناء، مثل فكك الأشياء وإعادة تركيبها بسهولة يبني تركيبات ممتعة ثلاثية الأبعاد مثل المكعبات (الليجو مثلا). يستمتع بعمل البازل (الألغاز)، المتاهات (لعبة البحث عن شيء في رسمه)؛ وغيرها من الأنشطةالبصرية (المرئية) مثل استخدام الخرائط. يحب التخطيط في الأوراق، اللوحات، على الرمل... وغيرها من الخامات",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("أنشطة تدعم هذه الذكاءات\nالنشاط الأول:",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text("علم الرسم خطوة خطوة",
          style: TextStyle(fontSize: 14), textAlign: TextAlign.start),
      Text("النشاط الثاني:",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "غير ترتيب الغرفة اسمح له بأن يعيد ترتيب حجرته، اسأله ما الترتيب الذي يحبه. اطلب منه رسم حجرته في ترتيبها القديم على شكل مربعات ومستطيلات ودوائر حسب شكل الأساس ثم اجلسا معا لتفكرا في ترتيب جديد للغرفة محاولا أن يجد عدة ترتيبات ممكنة.واطلب منه رسم كل ترتيب يفكر به",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("النشاط الثالث (نم التصور)",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "1-اطلب من طفلك التفكير في شيء ما. اطلب منه أن يحاول رؤية هذا الشيء (تصوره أثناء إغماضه عينيه. ناقش طفلك: ماذا ترى؟ ما التفاصيل التي تراها؟ ما لونه الذي تراه..؟ اطلب منه أن يظل مغمضا عينيه، واطلب منه أن يحاول تصور ورؤية هذا الشيء في حالة تحريكه للأمام، وتحريكه للخلف، أو أن يتصوره حين يغير لونه. استمر في التحدث حول هذا الشيء محاولا مساعدة طفلك على تخيله بتفاصيله مع تغيير هذه التفاصيل عن طريق التصور استمر في التحدث حول هذا الشيء محاولا مساعدة طفلك على تخيله بتفاصيله مع تغيير هذه التفاصيل عن طريق التصور",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text(
          "2- اطلب من طفلك أن يبدأ في تصور مكان جديد: مع تغيير إضاءته، مع تصوره صباحا ومساء.\n3- ثم طور التصور ليبدأ في تصور أشخاص داخل المكان.. وهم ثابتون، ثم متحركون تدرج في تدريب طفلك على التصور، ولكن استمر حتى يعتاد رؤية الأشياء بخياله كأنه يراها حقيقة.",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("النشاط الرابع: القصص التخيلي:",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "أحضر قصة جيدة غنية بصور ملونة.واجعله يسرد عليك احداثها بما توحيه عليه هذه القصة",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
    ],
  );
  var three = Column(
    mainAxisAlignment: MainAxisAlignment.center,
    crossAxisAlignment: CrossAxisAlignment.center,
    children: <Widget>[
      Text(
          "الذكاء البدني الحركي هو القدرة على استخدام الجسم بمهارة للتعبير عن النفس والتواصل والانتاج الفهم الأشخاص الذين يتمتعون بهذا الذكاء جيدون في التعامل مع الأشياء والأنشطة التي تتطلب أجسامهم وأيديهم وأصابعهم ولأن التعلم بالعمل learning by doing يحدث من خلال الحركة البدنية ",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("كيف أتعرف على هذا النوع من الذكاء لدى طفلي؟",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "لديه طريقة مميزة في تحصيل خبراته الحياتية بالحركة اللمس: العمل اليدوي. يتفوق في لعبة رياضية أو أكثر. لا يمكنه المكوث في مكانه لفترة طويلة. يستخدم تعبيرات وجهه وجسده كثيرا حين التعبير عن أفكاره ومشاعره. يمكنه تقليد حركات أو تعبيرات وجه الآخرين. يحب الحركة البدنية ، التمثيل والألعاب الحركية بكل أنواعها كالجري، القفز أو التسلق لديه مهارة في استخدام يديه وعضلاته الدقيقة، مثل: تقطيع الأخشاب الحياكة؛ استخدام العدد والآلات يستمتع باللعب بالطين، العجائن أو غيرها من الخبرات التي تتطلب اللمسية. و يستمتع بألعاب الفك والتركيب كالمكعبات والبناء؛ والليجو. غالبا يؤدي أداء أفضل لأي مهمة بعد رؤية شخص ما يقوم بها ثم يقوم بتقليد حركاته. ويفعل نفس الشيء إذا ما رغب في تعليم غيره",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("أنشطة وفعاليات\nالنشاط الأول: الدراما والتمثيل",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "- مثل أيا من القصص التي يحبها طفلك. مثلا معا حركات الأبطال، تعبيراتهم المختلفة. ويمكنك صنع بعض الوجوه المستعارة لتستعين بها في تمثيل الشخصيات المختلفة\n- درب طفلك على تقليد حركات الحيوانات المختلفة\n- درب طفلك على تقليد حركة الأشياء، مثل الطائرة الريشة القلم.\n- اشرك طفلك في لمس وتقطيع ومزج المكونات\n- ‏دعه يجرب دمج مكونات خلطة بسيطة\n- ‏علم طفلك بعض الربطات والتقد الكشفية",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
    ],
  );
  var four = Column(
    mainAxisAlignment: MainAxisAlignment.center,
    crossAxisAlignment: CrossAxisAlignment.center,
    children: <Widget>[
      Text("الذكاء الاجتماعي",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "الطفل الاجتماعي يستمتع بمشاركة الآخرين نشاطاتهم يعكس هذا النوع من الذكاء قدرة الفرد على فهم وإدراك وملاحظة مشاعر الآخرين وحالاتهم المزاجية، واحتياجاتهم، وتنعكس هذه القدرة في مهارات تعامل الفرد مع الاخرين وتحفيزهم. يتمتع بهذا النوع من الذكاء: المعالجون النفسيون، رجال المبيعات، المدرسون، المستشارون، مرشدو الشباب، العاملون في المجال الاجتماعي، رجال الدعوة، المدربون الرياضيون، مشرفو نشاط الأطفال",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("مميزات هذا الذكاء\nيتميز من يتمتع بهذا الذكاء بالصفات التالية:",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "- يستمتع بصحبة الناس أكثر من الانفراد\n- يعطي نصائح للأصدقاء الذين لديهم مشكلات.\n- يجب الانتماء للنوادي والتجمعات أو أي مجموعات منظمة\n- يستمتع بتعليم الآخرين بشكل كبير و لديه صداقة حميمة مع اثنين أو أكثر.\n- يبدي تعاطفًا واهتماما بالآخرين.\n- الآخرون يبحثون عن تعاطفه أو اهتمامه وصحبته. يسعى الآخرون لمشورته وطلب نصحه.\n- يفضل الألعاب والأنشطة والرياضات الجماعية ويسعى للتفكير في مشكلة ما بصحبة الآخرين أفضل مما يكون بمفرده .\n- يبدو جذابًا مشهورًا له شعبية.\n- يعبر عن مشاعره وأفكاره واحتياجاته.\n- يحب المناقشات الجماعية والاطلاع على وجهات نظر الآخرين وأفكارهم.\n- يمكنه التعرف على مشاعر الآخرين، وتسميتها كما يمكنه الانتباه لتغير الحالات المزاجية للآخرين.\n- يمكنه الانتباه لتغير الحالات المزاجية للآخرين و يحب الحصول على آراء الآخرين ويضعها في اعتباره\n- لا يخشى مواجهة الآخرين ويمكنه التفاوض والتأثير فى الأخرين\n- يمكنه عمل مناخ جيد أثناء وجوده ويمكنه تحفيز الأخرين ليقومو بأفضل ما لديهم",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text(
          "خطوات للتنمية\nيمكن تقوية هذا النوع من الذكاء بتنمية كل السمات السابقة لدى الطفل، بأنشطة جماعية ومنها:",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "- التفكير معا (العصف الذهني الجماعي).\n- الأنشطة الجماعية المختلفة ‏ومنح الطفل دور القيادة بعض الوقت\n- تعليمه وتدريبه على المهارات الاجتماعية المختلفة\n- تعليم مهارات التفاوض وفض النزاعات والتعامل مع الآخرين.\n- تعليمه التعاطف، والتعبير عن مشاعره وفهم مشاعر الآخرين. وتدريبه على القيادة والتخطيط وتحفيز الآخرين. وحث الطفل على القيام بأنشطة تطوعية جماعية، وتجد بعضها في تطوع الصغار.. حلم وإبداع ",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("أنشطة الذكاء الاجتماعي\nالنشاط الأول:",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "كل واحد يعلم واحدا ؟ افتح حوارا مع طفلك صاحب هذا الذكاء في وجود إخوته حول الأشياء أو المهارات التي يمكنه أن يعلمها لغيره. اترك المجال لباقي الأطفال ليفكروا في مهارة شيء مميز يفعلونه، ويمكنهم أن يعلموه للآخرين، فربما أمكن لواحد أن يكون عارفا بالأرقام بلغة جديدة.. عملات بلد ما، طريقة نشر الغسيل، وضع الأكواب بطريقة لطيفة ... ويرغب في تعليمها لغيره أو في أن يتبادل الأطفال تلك المهارات.",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text(
          "- افتح حوارا مع طفلك صاحب هذا الذكاء في وجود إخوته حول الأشياء أو المهارات التي يمكنه أن يعلمها لغيره.\n- اترك المجال لباقي الأطفال ليفكروا في مهارة شيء مميز يفعلونه، ويمكنهم أن يعلموه للآخرين، فربما أمكن لواحد أن يكون عارفا بالأرقام بلغة جديدة.. عملات بلد ما، طريقة نشر الغسيل، وضع الأكواب بطريقة لطيفة ... ويرغب في تعليمها لغيره أو في أن يتبادل الأطفال تلك المهارات.\n- سجل مهارات كل طفل في قائمة، ثم ابدأ في تفعيل رغبة كل واحد لتعليم الآخرين بطريقة علمية.\n- ناقش مع طفلك: ما الذي يحتاجه ليتم تعليمه لغيره، أيا من المهارات التي في القائمة، وما الخطوات التي سيتبعها.\n- كون مع طفلك قائمة الصغار الذين يحتاجون هذه المساعدة. ومن الممكن أن يكون ذلك في إطار الأسرة الواحدة أو بين أسرتين من الأقارب أو الأصدقاء. \n- لا يمكن أن تصنع مع طفلك بطاقات ملوّنة تحمل كل ما علمه طفلك لغيره وكل ما تعلمه طفلك من غيره أثناء رحلة تطوعه بالتعليم أو تدربه على يد غيره.",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("النشاط الثاني: استرجاع الذكريات الطيبة:",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "1-ساعدني السائق في حمل حقيبتي ,  علمني أخي كيف ألعب الشطرنج, شجعتني أمي على القفز في حمام السباحة., أثنت صديقتي على اختياري للألوان في لوحتي اجتمع مع أطفالك. اطلب من كل فرد منهم أن يتذكر عددا من الأشخاص الطيبين المتعاونين الذين عاونوه في شيء ما أو جعلوه يشعر شعورا جيدا، وسجلوا معا كل الخبرات كالآتي:",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text(
          "2- ناقشوا معا كيف يمكن أن يؤثر التعاون بين الأشخاص على مشاعرنا وعلي تحسين حياتنا\n3- يمكن أن يرسم الأطفال رسوما توضيحية لما مروا به من خبرات طيبة.\n4- يمكن أن تكون فرصة طيبة ليرسل للشخص الذي عاونه رسالة قصيرة يشكره على الشعور الطيب الذي سببه له تعاونه معه، على أن نحاول أن نجعل من هذا النشاط فرصة لادخال كلمات الامتنان إلى اقاموسه بحيث تصبح مألوفة مستخدمة من قبل الطفل، مثل: أتذكر عندما ...، ذات مرة ...، ساعدتني على...، كان لدي شعور بصعوبة الأمر حتى ساعدتني على. شكرا لك لأنك جعلتني أشعر به.",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("النشاط الثالث: تمييز المشاعر :",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "هذا النشاط يساعد الأطفال على الاستكشاف الذاتي، وخطوات هذا النشاط\n1- اكتب الجمل التالية على ورقة كبيرة أو لوحة، ثم ضعها في صندوق",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text(
          "- ماذا تشعر عندما يثني عليك على شيء جيد فعلته؟\n- لم يتم اختيارك في لعبة؟\n- تنجح في حل كل مسائل الحساب؟\n- أخذ زميل لك شيئا بالقوة؟\n- تتشارك مع زميل في عمل ما؟\n- تكسب مباراة؟\n- ا تريد الحصول على شيء يمتلكه آخرون؟\n- تُترك في البيت بمفردك؟\n- تقبلك أمك أو تعانقك؟\n- اتُتهم بفعل شيء لم تفعله؟\n- يخبرك شخص ما بأنك ذكي ولطيف ومهذب؟\n- عندما يلعب معك أخوك الأكبر؟",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text(
          "2- اجلس أنت وأطفالك في دائرة.\n3- اختر بالتناوب قائدا ليقف في وسط الدائرة:",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text(
          "- دعه يلتقط ورقة من الورق ويقرأ الجملة التي بها بصوت عال.\n- اطلب منه أن يختار شخصا ما من الدائرة ليتعاون معه بالرد، على أن يبدأ جملة ردد أشعر...، ويمكنه أن يعبر بالكلمات أو بتعبيرات الوجه والجسم ثم يخمن الشخص الآخر (قائد الدائرة) شعور المعبر، ويناقش لماذا يشعر شخص ما هذا الشعور يؤثر في سلوكه، وكيف يمكن أن يستبدل بالشعور السيء شعورا أخر جيدا.",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text(
          "4- المناقشة, أهم ما في هذا النشاط:\n- حاول أن يركز الجميع على كيفية الشعور والتعبير عنه، ولماذا يشعر كل فرد هذا الشعور، وكيف تجنب أحد ما شعورا سلبيًا، كذلك يساعد هذا النشاط في التعرف على مشاعر الآخرين عن طريق تعبيرات الآخرين لفظيًا أو بملامح الوجه والجسم.الجمل السابقة تمثل مجرد أمثلة للجمل التي يمكن مناقشتها والتمثيل حولها، ويمكن أن تنسج غيرها.",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("النشاط الرابع: الرسم الجماعي:",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "اجلسوا ما في دائرة ثم أعط كل طفل قطعة من الورق وقلما ملونَا. ثم اطلب منهم أن يبدأ كل منهم في رسم أي شيء في خياله. ثم بعد دقيقة واحدة، اطلب من كل منهم أن يمرر الورقة لليمين. واطلب منهم أن يرسموا مرة أخرى، إكمالاً على",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
    ],
  );
  var five = Column(
    mainAxisAlignment: MainAxisAlignment.center,
    crossAxisAlignment: CrossAxisAlignment.center,
    children: <Widget>[
      Text("يشير مفهوم الذكاء الذاتي",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "إلى معرفة الفرد الجيدة بذاته واتخاذ قرارات وتحديد أهداف هذه المعرفة الواعية والدقيقة بالذات، وكذلك توجيه المشاعر والأفكار والاحتياجات والتعامل معهن بوعي. وتتضمن هذه المعرفة بالذات: المشاعر والحالات المزاجية والرغبات، وكذلك طريقة التفكير والكيفية ال يحصل بها المعرفة، وأيضا الحوافز الداخلية والدوافع، ونقاط القوة والضعف، والأهداف والنوايا.",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("كيف أتعرف على هذا النوع من الذكاء؟",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "رغم صعوبة قياس هذه القدرة ومدى وجودها، فإن الدلائل يمكن أن تلاحظ في الأطفال أثناء استخدامهم ذكاءاتهم الأخرى\n- مدى معرفتهم بنقاط قوتهم وضعفهم. - القدرة على اتخاذ قرارات واختيارات مبنية على هذه المعرفة بذاتهم -  يعتمدون على حوافزهم الداخلية أكثر بكثير مما يعتمدون على ثناء أو مكافأة خارجية - يمكن أن يعبر جيدا عما يحب وما لا يحب. - لديه ثقة في قدراته. - يمكن أن يحدثك عن أهداف له، وأحلام يريد تحقيقها. - يفكر تفكيرا جادا في أن يكون له عمل خاص في المستقبل. - يحتفظ بمفكرة يدون فيها أفكاره، أحلامه، مشاعره، معارفه الجديدة. - لديه هوايات خاصة لا يعرف بها أحد، ولا يطلع عليها أحد. - ايحب الانفراد بنفسه. - يحب أن يكون مجددا، مبتكرا. - يعرف حدود نفسه ويرحب بالمغامرة والتجربة - يتقبل المسئولية عن تصرفاته - مثابر، يسير قدما نحو ما يريد وإن واجهته عوائق. - يتقبل آراء الآخرين فيه، ويعرف الصواب منها والخطأ . - يتمتع باستقلالية، ومسئولية عن تصرفاته. - لديه عدد قليل من الأصدقاء الحميمين. - يستخدم حديثه الداخلي مع نفسه ليتعلم شيئا ما، أو يفكر في شيء ما. - يشعر بثقة كبيرة في نفسه و نادرا ما يطلب مساعدة أحد في حل مشكلاته الشخصية - يستمتع بالأنشطة الفردية - يحب كتابة وقراءة القصائد والتاريخ العائلي، والسير الذاتية، والتراجم. - يتعلم جيدا عن طريق العمل بمفرده، خاصة في أماكن خاصة به . ومنحه وقتا للتفكر، ودمج الجديد الذي يتعلمه مع معارفه وخبراته القديمة.وكذلك منحه فرصة ليكون وجهة نظر خاصة",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("انشطة وفعاليات - أنشطة ذهنية\nالنشاط الأول: المراة",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "اطلب من طفلك أن ينظر في المرأة ,اسأله: ما ملامحه المميزة؟ من يشبه؟ ما الذي يجعله مميزا؟\nاطلب منه أن يرسم صورة لنفسه. ويتحدث عنها، بينما يتحدث سجل ما يقول، وأعد  ما قال في قصة\nأخبره بشعور معين مثلا: غاضب، حزين، سعيد...، واطلب منه أن يغير تعبيرات وجهة لتناسب كل شعور. وينظر في المرأة ليعرف تعبيرات وجهه المختلفة مع المشاعر المختلفة",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("النشاط الثاني: صف نفسك",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "اكتب على ورقة حروف اسم طفلك، وحروف اسمك, اطلب منه أن يكتب لكل حرف من اسمه صفة أو جملة تعبر عن شيء مميز فيه، صفاته، أفكاره، آرائه، مزاياه، أشياء يمكنك عملها.\nثم ناقش مع طفلك هذه الصفات: ما سببها؟ كيف اكتسبها؟ مزاياها، ما أثرها عليه؟ كيف يمكنه تغيير إحداها؟ كيف يمكنه تنمية الصفات الإيجابية الأخرى؟ ما أثر هذه الصفات على دراسته؟ علاقته بأصحابه، علاقته بإخوته، أبويه؟",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("النشاط الثالث: ناقش",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "اطلب من طفلك أن يذكر لك ثلاث وجبات، ثلاث مناسبات، ثلاثة أوقات كان لها أثر قوي على نفسه.",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
    ],
  );
  var six = Column(
    mainAxisAlignment: MainAxisAlignment.center,
    crossAxisAlignment: CrossAxisAlignment.center,
    children: <Widget>[
      Text(
          "القدرة على الاستماع للأصوات المختلفة ، والحساسية للإيقاعات والطبقات المختلفة للصوت ، وإدراك ماتتضمنه هذه الأصوات من معلومات",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("انشطة لتمتين الذكاء الصوتي الايقاعي",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "1- تحفيظ القرآن وحفظ الأناشيد ذات السجع\n2- التنغيم وهو القدرة على الإتيان بكلمات لها نفس النغمة\n3- المزج الصوتي: القدرة على تمييز الأصوات بعضها عن البعض\n4- المنشد الصغير: في كتاب لغتي بعض القصائد والمقطوعات يمكن أن يحفز لتلحينها\n5- محاكاة الاصوات: من الانشطة التي يمكن ان تنمي الذكاء الصوتي الايقاعي هو تقليد الاصوات الطبيعية او البشرية\n6- المشاركة بفرق الانشاد الجماعي بالمدرسة\n7- اطلب منه تلحين الدروس و ما يستهويه من كلمات\n8- ردد نغمات مختلفة و اطلب من الطفل تقليدها و ابتكار إيقاعات مشابهة\n9- ساعد الطفل على استذكار أصوات , و هو في حالة استرخاء",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
    ],
  );
  var seven = Column(
    mainAxisAlignment: MainAxisAlignment.center,
    crossAxisAlignment: CrossAxisAlignment.center,
    children: <Widget>[
      Text("يعبر الذكاء الطبيعي ",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "على قدرة الإنسان على التمييز بالمقارنة بالكائنات الحية (النباتات، الحيوانات) إضافة الخصائص العالم الطبيعي والظواهر الطبيعية (كالأحجار الطبيعية..). كما يشير أيضا إلى القدرة على تمييز الملامح الثقافية المحددة لبيئة معينة.",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text(
          "كيف أتعرف على الأطفال على الأطفال الذين يتمتعون بهذا النوع من الذكاءات؟ ",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "_.يهتم بالحيوانات الأليفة. _يستمتع بزيارة الحدائق و الطبيعية، المتاحف المائية، متاحف النباتات، وغيرها - التخييم والخروج في الطبيعة من الأنشطة المحببة جدا له. _ يستمتع بالعمل في الحدائق. يستمتع بدراسة البيئة، الطبيعة، النباتات، الحيوانات يهتم بالمشكلات البيئية. يجمع فراشات، زهورا، أوراق شجر، أحجارا، أصدافا وغيرها من الأشياء الطبيعية.  يستمتع بتصنيف الأشياء تبعا لخصائصها المتشابهة. وغالبا ما يقوم بتدوير المواد المختلفة وإعادة استخدامها مرة أخرى يمكنه إخبارك بالفروق بين نوعين من النباتات مثلا. يحب قراءة كتب ومجلات، وكذلك رؤية برامج تلفزيونية حول الطبيعة. ",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("كيف ننمي هذا النوع من الذكاء؟",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "الأطفال يولدون محبين للطبيعة. ولا يحتاجون للمساعدة، ولكن فقط يحتاجون الفرصة لاستكشاف العالم عن طريق حواسهم. | امنحه الفرصة للخروج للطبيعة والتفاعل مع عناصرها المختلفة: ملاحظة وردة، زهرة، طائر. أو اختبار شجرة على جانبي الطريق،  جمع أنواع من الأحجار أو القواقع، وتصنيفها .\n: اشتر بعض الأدوات التي تعينك على الاستكشاف مثل: مجهر، عدسة مكبرة، شريط قياس، قفازات، عبوة للسقي، سلة، أكياس لجمع العينات، ملقاط، مفكرة لتسجيل ملاحظاته..\n - اشرح وصف التغيرات في البيئة المحيطة أو البيئة الكونية الكبيرة\n- ساعده ليجد حديقة حيوانا أليفا ليعتني به طفلك.\nشجع طفلك ليسأل ويستكشف ويبحث عن إجاباته حول العالم كله\n اسأل طفلك كثيرا، واغتنم كل فرصة لتسأل أو تفجر سؤالا لديه ليتشوق لمعرفة إجابته: لماذا ا الطيور تبنى أعشاشها؟ بمن تصنعها؟ هل كل الطيور لها نفس النوع من العش؟ لماذا تختلف؟ ما المتشابه عش العصفور، والغراب.. ما المختاف، لماذا؟\n ساعد طفلك لينتبه لما يدور حوله وساعده ليسجل هذه الملاحظات، سواء كانت ملاحظة بسيطة لو زهرة، أو طريقة مشي حيوان، أو نوع غذاء لكائن أخر... لاحظا معا وساعد طفلك ليسجل ملاحظاته فالملاحظة أول مهارة من مهارات التفكير العلمي",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text(
          "اجعل طفلك يبحث عن التشابهات والاختلافات بين الأشياء: الزهور، الحيوانات، النباتات، الأشجار،الأحجار، المسطحات المائية، الحدائق في كل العالم... وسبب التشابه والاختلاف بين الأشياء\n ساعد طفلك ليتعرف العلاقة بين السبب والنتيجة: ماذا يحدث لو سقينا النبات، ماذا يحدث لو منعنا الضوء عن النبات...؟\n اهتم بالمجال الذي يجتذب طفلك وانطلق من حيث يوجهك باهتمامه: فإذا كان يحب الديناصورات، اقرأ عنها وساعده ليصنعها بالصلصال، أجمعا معا صورا مختلفة عنها، شاهدا برامج وأفلاما عن الديناصورات..، اجلب له ألعابا تركيبية عن الديناصورات، شاهداه في متحف العلوم",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("أنشطة وفعاليات : ‏1-النبات والضوء",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          " ‏اقطع قطعا من الورق المقوى على شكل اوراق نبات ألصق كلا من هذه الأشكال على ورقة شجر سواء خارج البيت أو داخله، واحرص على عدد أوراق الشجر اترك واحدة من هذه الأوراق لمدة يوم، وورقة أخرى ليومين، وورقة لثلاثة أيام.. تابع مع طفلك الذي يحدث كل يوم في شكل ولون كل ورقة شجر من الأوراق الثلاثة. واختلافها عن الأوراق بعد كم من الوقت بدأت في الذبول، تغير لونها ابحثا لماذا.. ساعد طفلك ليسجل ما فعل، ماذا لا ما تساؤله الجديد ...؟",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("النشاط الثاني ",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "صور النجوم نقطة لنقطة معا أنت وطفلك، لاحظا النجوم في مساء صاف وواضح. ارسما النجوم التي رأيتما على قطعة من الورق وساعد طفلك ليوصل ويستكشف الصورة: الدب الأكبر أو الأصغر، الفرس، أو أي شيء يمكنك تخيله.",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("النشاط الثالث: صنف:",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "جمع عدة أنواع من الأحجار، العصي، الرمال.. وأعط الطفل عددا من الأكواب ليصنفها في مجموعات. ثم اطلب منه أن يرتبها ترتيبا معينا يقترحه: العناصر الكبيرة ثم الأصغر فالأصغر، العناصر داكنة اللون ثم الأفتح فالأفتح... وهكذا. حاول أن تدرب طفلك على تصنيف كل ما يمر بكما",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
      Text("النشاط الرابع: المتحف الصغيرة",
          style: TextStyle(fontSize: 14, color: coloor),
          textAlign: TextAlign.start),
      Text(
          "اجمع عددا من علب الألبان الورقية. اقطع الجزء العلوي منها ثم ألصقها معا بحيث تكون الأجزاء المفتوحة كلها في اتجاه واحد. دع طفلك يبتكر متحفه الخاص، اطلب منه أن يملاً كل مساحة بنوع من الأشياء التي جمعها: الأحجار،القواقع، الزهور،... ربما رغب الطفل في عمل تكوينات من عدة عناصر ذات علاقة معا.  دعه يبتكر وشجعه ليدعو الأقارب والأصدقاء ليشاهدوا متحفه ويشرح لهم ما يعرفه عن مجموعاته",
          style: TextStyle(fontSize: 14),
          textAlign: TextAlign.start),
    ],
  );
}
