class DataWhy {
  var questions = [
    [
      "العبارات الشائعة",
      "▪️ طفلي بليد جدًا  لا يمكنه أن يكتب أبدا\n▪️ ‏طفلي رغم أنه رائع وذكي جدا ، فإنه لا يتقدم كما ينبغي في كرة القدم . \n‏▪️ طفلي لا يكف عن الثرثرة كم أتمنى أن يصمت.\n▪️ الدراسة بالنسبة لنا كابوس فظيع\n‏▪️ جميع أطفالي أذكياء ماعدا هذا الطفل الذي لا أعرف من أين ورث هذا الغباء!\n‏▪️ ولو أني أعلم لماذا يصر على جمع القمامة من كل مكان  بل والاحتفاظ بها كأنها ثروة غالية ؟! ! \n‏▪️ ابني غير متميز في شيء على الإطلاق . . الشيء الذي يتميز فيه هو التخريب أو الجري والقفز »\n\nتتنوع العبارات على ألسنة الآباء والأمهات في وصفهم وتقييمهم لأطفالهم والتي يتضح من خلالها نسبة التضجر والملل في محاولة يائسة لقصر قدراتهم لنوع أو أسلوب محدد نريدهم عليه"
    ],
    ["لماذا ابنى اذكى مما أتوقع ؟", "1- لأن أغلب اختبارات الذكاء تهتم   بالطلاقة اللفظية والقدرة الحسابية  وهما على أهميتهما يعتبران نوعين فقط من أنواع الذكاءات المختلفة والمتعددة.\n2- لأننا جعلنا أنفسنا مقياسا ونموذجا مثاليا لتقييم سلوكياتهم ومواهبهم فحجمنا مواهبهم فيما نعرف ونحب.\n3- لأننا جعلنا الذكاء قرين التفوق الدراسي وما هو إلا مؤشر  فقط  يحكمه ظرف وحال وشخصية وبيئة.\n4- لأننا قارنهم بغيرهم وقتلنا بذرة التفرد لديهم فأصبحوا نسخا مقلدة.\n5- لآننا أخذنا التربية بالتلقين فأصبحوا حقل تجارب لاجتهاداتنا."],
  ];
}
